<template>
  <div class="page-content">
    <h1>О проекте</h1>

    <p>
      Cервис «Проверка подписи» позволяет проверять действительность
      квалифицированной электронной (цифровой) подписи в PDF-документах и
      получать детальный отчет с данными подписей и сертификатов.
    </p>
    <h2>Проверка подписи внутри документа</h2>
    <p>
      На первом этапе сервис поддерживает проверку подписи внутри PDF-документа,
      чуть позже будет запущен также вариант проверки отсоединенной цифровой
      подписи.
    </p>
    <h2>Поддерживаемые форматы</h2>
    <p>
      Поддерживаются все актуальные форматы подписи с российскими
      ГОСТ-алгоритмами:
    </p>
    <ul>
      <li>CMS,</li>
      <li>CAdES-BES,</li>
      <li>CAdES-T,</li>
      <li>CAdES-X Long Type 1.</li>
    </ul>
    <h2>Технологии</h2>
    <p>
      В основе проекта лежит стэк из JavaScript, Golang, C#, .NET Framework,
      MySQL и сертифицированных библиотек по работе с российскими электронными
      подписями от КриптоПРО.
    </p>
    <p>Сервер состоит из нескольких независимых модулей:</p>
    <ul>
      <li>
        Лёгкий и быстрый сайт на JavaScript, Vue.js и Nuxt.js, который
        взаимодействует с сервером через REST API.
      </li>
      <li>
        Быстрый веб-сервер на Golang для работы при высоких нагрузках, в котором
        реализован REST API.
      </li>
      <li>
        Асинхронный сервер проверки ЭП на C# с формированием исчерпывающей
        информации по подписям и сертификатам.
      </li>
      <li>
        Сервер обновления сертификатов аккредитованных Удостоверяющим центром на
        C#.
      </li>
      <li>Служебный модуль для логирования и нотификаций.</li>
    </ul>
    <h2>Внедрение технологии в ваш проект</h2>
    <p>
      Все модули могут работать на одном Windows-сервере или распределяться по
      разным серверам. Проект полностью готов к быстрому развертыванию на
      сторонних серверах и интеграции в системы ЭДО как через REST API, так и
      при локальной установке, в том числе и с полным предоставлением исходного
      кода и документации.
    </p>
  </div>
</template>

<script>
export default {
  layout: "inner"
};
</script>
