<template>
  <div class="page-content">
    <h1>Условия использования</h1>
    <h2>Отказ от ответственности и обязательств</h2>
    <p>
      Сайты <a href="">vedisi.ru</a> и <a href="">проверка-подписи.рф</a> и
      сервис проверки Электронной подписи (ЭП) от ООО «Твин Пикс» носят лишь
      информационный характер, а результат их работы не имеет юридической силы.
    </p>

    <p>
      ООО «Твин Пикс» не является доверенной третьей стороной по проверке
      электронной подписи в рамках Федерального Закона №63 «Об электронной
      подписи». ООО «Твин Пикс» не обладает никакими полномочиями, обязанностями
      и не несет никакой ответственности доверенной третьей стороны в рамках
      этого закона.
    </p>
    <h2>Правила использования сайтов и сервиса проверки электронной подписи</h2>
    <p>
      Вы можете пользоваться сайтами и сервисом проверки Электронной подписи
      только в рамках сайтов <a href="">vedisi.ru</a> и
      <a href="">проверка-подписи.рф</a>, используя веб-браузер. Интегрировать
      сервис в другие программные продукты без согласия компании «Твин Пикс» не
      разрешается.
    </p>
    <h2>Хранение и обработка данных пользователей сайта</h2>
    <p>
      Переданные для проверки файлы хранятся на сервере только до завершения
      процесса проверки. Файлы используются только для проверки действительности
      Электронной подписи. Как только процесс проверки завершается, файлы
      удаляются на сервере, на сервере остается лишь результат проверки.
      Результат проверки хранится на сервере до запроса его выдачи, но не более
      12 часов. После этого результат проверки удаляется с сервера. От проверки
      остаётся только служебная информация (когда и с какого IP поступил запрос
      на проверку), которая хранится не более 10 дней.
    </p>
    <h2>Обработка персональных данных</h2>
    <p>
      Мы не обрабатываем какие-либо типизированные персональные данные внутри
      документов, не анализируем и не собираем персональные данные из документов
      пользователей. Результаты проверки могут содержать данные сертификатов ЭП,
      которые могут относиться к персональным данным. Результаты проверки
      доступны только пользователю, запустившему проверку файлов, и хранятся не
      более 12 часов на сервере сервиса.
    </p>
    <h2>Используемое по и сторонние данные для работоспособности сервиса</h2>
    <p>
      В основе сервиса лежит официально сертифицированное ПО (библиотеки) по
      работе с ЭП:
    </p>
    <ul>
      <li>КриптоПро CSP.</li>
      <li>КриптоПро .NET.</li>
      <li>КриптоПро ЭЦП SDK.</li>
      <li>КриптоПро TSP SDK.</li>
    </ul>
    <br />
    <p>Сервис оперирует сторонними данными:</p>
    <ul>
      <li>
        Данные реестра уполномоченного федерального органа в сфере использования
        электронной подписи.
      </li>
    </ul>
  </div>
</template>
